<script setup>
import axios from "axios";

// Реактивная переменная для хранения данных
const data = ref([
    {
        id: 0,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Смоленский государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО СГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "214019, Смоленская область, г. Смоленск, ул. Крупской, д. 28",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 1,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Северо-Осетинская государственная медицинская академия» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО СОГМА Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "362019,  Республика Северная Осетия-Алания, г.  Владикавказ, ул. Пушкинская,  д. 40",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 2,
        schoolName:
            "Автономная некоммерческая организация высшего образования Институт законоведения и управления ВПА",
        shortName: "АНО ВО ИЗУ ВПА",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "300028, г. Тула, ул. Болдина, д. 98",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 3,
        schoolName:
            "Федеральное государственное бюджетное учреждение науки Институт философии Российской академии наук",
        shortName: "Институт философии РАН",
        schoolTypeName: "Научные организации",
        lawAddress: "109240, г. Москва, ул. Гончарная, д. 12, стр. 1",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 4,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Казанский государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО Казанский ГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "420012, Республика Татарстан, город  Казань, улица Бутлерова, дом 49",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 5,
        schoolName:
            "Государственное бюджетное образовательное учреждение высшего образования «Высшая школа музыки Республики Саха (Якутия)  (институт) имени В.А. Босикова»",
        shortName: "ГБОУ ВО ВШМ РС (Я) (институт) им. В.А. Босикова",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "677007,  Республика Саха (Якутия), г. Якутск, ш. Покровское, 16 км., д. 2",
        utc: 9,
        number_of_user: 3,
    },
    {
        id: 6,
        schoolName:
            "федеральное государственное казенное образовательное учреждение высшего образования «Ростовский юридический институт Министерства внутренних дел Российской Федерации»",
        shortName:
            "ФГКОУ ВО РЮИ МВД России; Ростовский юридический институт МВД России; Ростовский ЮИ МВД России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "344015, Ростовская область, г. Ростов-на-Дону, ул. Еременко, д. 83",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 7,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Читинская государственная медицинская академия» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО ЧГМА Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "672000, Забайкальский край, г. Чита, ул. Горького, д. 39 «а»",
        utc: 9,
        number_of_user: 3,
    },
    {
        id: 8,
        schoolName:
            'Федеральное государственное унитарное предприятие "Государственный научно-исследовательский институт органической химии и технологии',
        shortName: "ФГУП ГосНИИОХТ",
        schoolTypeName: "Научные организации",
        lawAddress: "111024, город Москва, шоссе Энтузиастов, дом 23",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 9,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Волгоградский государственный технический университет»",
        shortName:
            "ФГБОУ ВО «Волгоградский государственный технический университет», Волгоградский государственный технический университет, ВолгГТУ",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "400005, г. Волгоград, проспект им. В.И. Ленина, д. 28",
        utc: 4,
        number_of_user: 3,
    },
    {
        id: 10,
        schoolName:
            "Религиозная организация – духовная образовательная организация высшего образования «Кузбасская православная духовная семинария Кемеровской Епархии Русской Православной Церкви (Московский Патриархат)»",
        shortName: "",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "654025, Кемеровская обл., г. Новокузнецк, ул. Зыряновская, 97",
        utc: 7,
        number_of_user: 3,
    },
    {
        id: 11,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Сахалинский государственный университет»",
        shortName:
            "СахГУ, ФГБОУ ВО «СахГУ», ФГБОУ ВО «Сахалинский государственный университет»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "693008, г. Южно-Сахалинск, ул. Ленина, д. 290",
        utc: 11,
        number_of_user: 3,
    },
    {
        id: 12,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Ковровская государственная технологическая академия имени В.А. Дегтярева»",
        shortName:
            "Ковровская государственная технологическая академия имени В.А. Дегтярева, ФГБОУ ВО «КГТА им. Дегтярева»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "601910, Владимирская область, г. Ковров, ул. Маяковского, д. 19",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 13,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Санкт-Петербургский государственный  педиатрический медицинский университет»  Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО СПбГПМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "194100,  г. Санкт-Петербург, улица Литовская, д. 2",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 14,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Астраханский государственный технический университет»",
        shortName: "ФГБОУ ВО «АГТУ»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "414056, Астраханская область, г.о. город Астрахань, г Астрахань, ул Татищева, стр. 16/1",
        utc: 4,
        number_of_user: 3,
    },
    {
        id: 15,
        schoolName:
            "федеральное государственное казенное общеобразовательное учреждение «Средняя общеобразовательная школа № 6»",
        shortName: "ФГКОУ СОШ № 6",
        schoolTypeName: "Общеобразовательная организация",
        lawAddress:
            "620075, Свердловская область, г. Екатеринбург, проспект Ленина, д. 71",
        utc: 5,
        number_of_user: 1,
    },
    {
        id: 16,
        schoolName:
            "Акционерное общество «Иркутский научно-исследовательский институт благородных и редких металлов и алмазов»",
        shortName: 'АО "ИРГИРЕДМЕТ',
        schoolTypeName: "Научные организации",
        lawAddress: "664025, г. Иркутск, бульвар Гагарина, д. 38",
        utc: 8,
        number_of_user: 3,
    },
    {
        id: 17,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Южно-Уральский  государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО ЮУГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "454141, Челябинская область, г. Челябинск, ул. Воровского, 64",
        utc: 5,
        number_of_user: 3,
    },
    {
        id: 18,
        schoolName:
            "Государственное автономное образовательное учреждение Тюменской области дополнительного профессионального образования «Тюменский областной государственный институт развития регионального образования»",
        shortName: "ГАОУ ТО ДПО «ТОГИРРО»",
        schoolTypeName:
            "Организации дополнительного профессионального образования",
        lawAddress: "625000, г. Тюмень, ул. Советская,  56",
        utc: 5,
        number_of_user: 1,
    },
    {
        id: 19,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Волгоградский государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО ВолгГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "400066, Волгоградская область, г. Волгоград, пл. Павших борцов, зд. 1",
        utc: 4,
        number_of_user: 3,
    },
    {
        id: 20,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Тюменский государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО Тюменский ГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "625023, Тюменская обл., г. Тюмень, ул. Одесская, дом 54",
        utc: 5,
        number_of_user: 3,
    },
    {
        id: 21,
        schoolName:
            "Образовательное частное учреждение высшего образования «Международный инновационный университет»",
        shortName: "ОЧУВО «Международный инновационный университет»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "354000, Краснодарский край, гор. Сочи, ул. Орджоникидзе, дом 10 «А»",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 22,
        schoolName:
            "Акционерное общество «Всероссийский нефтегазовый научно-исследовательский институт имени академика А.П.Крылова»",
        shortName: "АО «ВНИИнефть»",
        schoolTypeName: "Научные организации",
        lawAddress: "127422, г. Москва, Дмитровский проезд, д. 10",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 23,
        schoolName: "АКЦИОНЕРНОЕ ОБЩЕСТВО «РОССЕТИ НАУЧНО-ТЕХНИЧЕСКИЙ ЦЕНТР»",
        shortName: "АО «РОССЕТИ НАУЧНОТЕХНИЧЕСКИЙ ЦЕНТР»",
        schoolTypeName: "Научные организации",
        lawAddress: "115201, г. Москва, Каширское шоссе, д. 22, корп. 3",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 24,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Воронежский государственный педагогический университет»",
        shortName:
            'ФГБОУ ВО «Воронежский государственный педагогический университет», ФГБОУ ВО "ВГПУ", «Воронежский государственный педагогический университет», ВГПУ',
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "394043, Воронежская область, г. Воронеж, ул. Ленина, д. 86",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 25,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Ижевская государственная медицинская академия» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО ИГМА Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "426056, Удмуртская Республика, г. Ижевск, ул. Коммунаров, д. 281",
        utc: 4,
        number_of_user: 3,
    },
    {
        id: 26,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Самарский государственный технический университет»",
        shortName:
            "ФГБОУ ВО «Самарский государственный технический университет», ФГБОУ ВО «СамГТУ», СамГТУ, Самарский государственный технический университет",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "443100, Самарская область, город Самара, ул. Молодогвардейская, д. 244",
        utc: 4,
        number_of_user: 3,
    },
    {
        id: 27,
        schoolName:
            'федеральное государственное казенное военное профессиональное образовательное учреждение "183 учебный центр" Министерства обороны Российской Федерации',
        shortName: 'ФГКВПОУ "183 учебный центр", 183 учебный центр, 183УЦ',
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "344038, Ростовская  область, город Ростов-на-Дону, проспект Михаила Нагибина,  дом 24/50",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 28,
        schoolName:
            "Федеральное государственное казенное учреждение «Войсковая часть 35533»",
        shortName: "ФГКУ «В/ч 35533»",
        schoolTypeName: "Научные организации",
        lawAddress:
            "143988, Московская область, город Балашиха,  микрорайон Павлино, владение 1В, строение 1",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 29,
        schoolName:
            "Федеральное бюджетное учреждение науки «Санкт-Петербургский научно-исследовательский институт эпидемиологии и микробиологии им. Пастера» Федеральной службы по надзору в сфере защиты прав потребителей и благополучия человека",
        shortName: "ФБУН НИИ эпидемиологии и микробиологии имени Пастера",
        schoolTypeName: "Научные организации",
        lawAddress: "197101, г. Санкт-Петербург, ул. Мира, д. 14",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 30,
        schoolName:
            "Федеральное государственное бюджетное учреждение «Всероссийский научно-исследовательский институт труда» Министерства труда и социальной  защиты Российской Федерации",
        shortName: "ФГБУ «ВНИИ труда» Минтруда России",
        schoolTypeName: "Научные организации",
        lawAddress: "105043, г. Москва, ул. 4-я Парковая, д. 29",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 31,
        schoolName:
            'федеральное государственное бюджетное образовательное учреждение высшего образования "Иркутский государственный медицинский университет" Министерства здравоохранения Российской Федерации',
        shortName: "ФГБОУ ВО ИГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "664003, Иркутская область, г. Иркутск, ул. Красного Восстания, стр. 1",
        utc: 8,
        number_of_user: 3,
    },
    {
        id: 32,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Санкт-Петербургская государственная художественно-промышленная академия имени А.Л. Штиглица»",
        shortName:
            'ФГБОУ ВО "СПГХПА им. А.Л. Штиглица", СПГХПА им. А.Л. Штиглица',
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "191028, г. Санкт-Петербург, Соляной переулок, д. 13",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 33,
        schoolName:
            "Акционерное общество «Летно-исследовательский институт имени М.М. Громова»",
        shortName: "АО «ЛИИ им. М.М. Громова»",
        schoolTypeName: "Научные организации",
        lawAddress:
            "140180, Московская область, г. Жуковский, ул. Гарнаева, д. 2А",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 34,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Хакасский государственный университет им. Н.Ф. Катанова»",
        shortName:
            "ФГБОУ ВО «ХГУ им. Н.Ф. Катанова», Хакасский государственный университет им. Н.Ф. Катанова",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "655017, Республика Хакасия, г. Абакан, проспект Ленина, д. 90",
        utc: 7,
        number_of_user: 3,
    },
    {
        id: 35,
        schoolName:
            "Негосударственное образовательное частное учреждение высшего образования «Московский институт психоанализа»",
        shortName: "НОЧУ ВО «Московский институт психоанализа»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "121170,  г. Москва, Кутузовский  проспект, д. 34, стр. 14",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 36,
        schoolName:
            "частное образовательное учреждение высшего образования «Санкт-Петербургский университет технологий управления и экономики»",
        shortName:
            "ЧОУ ВО «Санкт-Петербургский университет технологий управления и экономики» или СПбУТУиЭ или Санкт-Петербургский университет технологий управления и эк",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "190020, г. Санкт-Петербург, Лермонтовский проспект, д. 44, литер А",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 37,
        schoolName:
            "частное образовательное учреждение высшего образования «Восточная экономико-юридическая гуманитарная академия»",
        shortName: "Академия ВЭГУ",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "450092, Республика Башкортостан, г. Уфа, ул. Мубарякова, д. 3",
        utc: 5,
        number_of_user: 3,
    },
    {
        id: 38,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Орловский государственный аграрный университет имени Н.В. Парахина»",
        shortName: "ФГБОУ ВО Орловский ГАУ",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "302019, Орловская область, г. Орёл, ул. Генерала Родина, д. 69",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 39,
        schoolName:
            "Автономная некоммерческая организация высшего образования «Межрегиональный открытый социальный институт»",
        shortName:
            "АНО ВО МОСИ, АНО ВО «Межрегиональный открытый социальный институт»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "424007, Россия, Республика Марий Эл, г. Йошкар-Ола, ул. Прохорова, д. 28",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 40,
        schoolName:
            'АВТОНОМНАЯ НЕКОММЕРЧЕСКАЯ ОРГАНИЗАЦИЯ ВЫСШЕГО ОБРАЗОВАНИЯ "МОСКОВСКИЙ ГУМАНИТАРНО-ТЕХНОЛОГИЧЕСКИЙ УНИВЕРСИТЕТ - МОСКОВСКИЙ АРХИТЕКТУРНО-СТРОИТЕЛЬНЫЙ ИНСТИТУТ',
        shortName:
            "МГТУ-МАСИ; МГТУ; МАСИ; МОСКОВСКИЙ ГУМАНИТАРНО-ТЕХНОЛОГИЧЕСКИЙ УНИВЕРСИТЕТ; МОСКОВСКИЙ АРХИТЕКТУРНО-СТРОИТЕЛЬНЫЙ ИНСТИТУТ",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "109316, г. Москва, Волгоградский проспект, д. 32, корп. 11",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 41,
        schoolName:
            "Акционерное общество «Научно-производственное предприятие «Пульсар»",
        shortName: "АО «НПП «Пульсар»",
        schoolTypeName: "Научные организации",
        lawAddress: "105187, город Москва, Окружной проезд, 27",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 42,
        schoolName:
            'Религиозная организация - духовная образовательная организация высшего образования евангельских христиан-баптистов "Санкт-Петербургский Христианский Университет',
        shortName: "",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "190020, Санкт-Петербург, Нарвский пр., 13 Б",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 43,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Пермская государственная фармацевтическая академия» Министерства здравоохранения  Российской Федерации",
        shortName: "ФГБОУ ВО ПГФА Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "614990,  Пермский край, г.  Пермь, ул. Екатерининская, 101",
        utc: 5,
        number_of_user: 3,
    },
    {
        id: 44,
        schoolName:
            "Федеральное государственное бюджетное учреждение науки Северо-Восточный комплексный научно-исследовательский институт им. Н.А. Шило Дальневосточного отделения Российской академии  наук",
        shortName: "СВКНИИ ДВО РАН",
        schoolTypeName: "Научные организации",
        lawAddress: "685000, г. Магадан, ул. Портовая, д. 16",
        utc: 11,
        number_of_user: 3,
    },
    {
        id: 45,
        schoolName:
            "Некоммерческое образовательное частное учреждение высшего образования «Гуманитарный институт имени П.А. Столыпина»",
        shortName:
            "НОЧУ ВО «Гуманитарный институт имени П.А. Столыпина», Гуманитарный институт имени П.А. Столыпина",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "115093, г. Москва, ул. Б. Серпуховская, д. 44, офис 19",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 46,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Кубанский государственный технологический университет»",
        shortName:
            "ФГБОУ ВО «КубГТУ», КубГТУ, ФГБОУ ВО «Кубанский государственный технологический университет», Кубанский государственный технологический университет",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "350072, Краснодарский край, г. Краснодар, ул. Московская, д. 2",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 47,
        schoolName:
            "федеральное государственное бюджетное  образовательное учреждение высшего образования «Ставропольский государственный медицинский университет» Министерства здравоохранения Российской Федерации",
        shortName: "ФГБОУ ВО СтГМУ Минздрава России",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "355017,  Ставропольский край,  г.  Ставрополь,  ул.  Мира,  310",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 48,
        schoolName:
            "Государственное автономное образовательное учреждение высшего образования Ленинградской области «Ленинградский государственный университет имени А.С. Пушкина»",
        shortName: "ГАОУ ВО ЛО «ЛГУ им. А.С. Пушкина»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "196605, г. Санкт-Петербург, г. Пушкин, Петербургское шоссе, д. 10",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 49,
        schoolName:
            "Частное образовательное учреждение высшего образования ИНСТИТУТ ИНОСТРАННЫХ ЯЗЫКОВ",
        shortName: "ЧОУ ВО ИНСТИТУТ ИНОСТРАННЫХ ЯЗЫКОВ",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "199178, г. Санкт-Петербург, В.О., 12 линия, д. 13, литер А, помещение 19-Н.",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 50,
        schoolName:
            "федеральное государственное бюджетное образовательное учреждение высшего образования «Ивановский государственный университет»",
        shortName:
            'ИвГУ, ФГБОУ ВО "ИвГУ", ФГБОУ ВО "Ивановский государственный университет", Ивановский государственный университет',
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress: "153025, Ивановская область, г. Иваново, ул. Ермака, д. 39",
        utc: 3,
        number_of_user: 3,
    },
    {
        id: 51,
        schoolName:
            "Государственное бюджетное образовательное учреждение высшего образования «Башкирская академия государственной службы и управления при Главе Республики Башкортостан»",
        shortName:
            "ГБОУ ВО «БАГСУ», ГБОУ ВО «Башкирская академия государственной службы и управления при Главе Республики Башкортостан»",
        schoolTypeName: "Образовательная организация высшего образования",
        lawAddress:
            "450008, Республика Башкортостан, г. Уфа, ул. Заки Валиди, д. 40",
        utc: 5,
        number_of_user: 3,
    },
]);
</script>

<template>
    <div class="table">
        <div class="text-sm p-1 text-center">
            Для примера приведена часть данных
        </div>
        <UTable :data="data" class="flex-1 table-data" color="neutral" />
    </div>
</template>

<style>
/* Стили для таблицы */
.table {
    height: 500px;
    display: block;
    padding: 10px;
    overflow: auto;
}

/* Стили для ячеек таблицы */
.table-data td,
.table-data th {
    max-width: 300px; /* Ограничиваем ширину ячеек */
    white-space: nowrap; /* Запрещаем перенос текста */
    overflow: hidden; /* Скрываем выходящий за пределы текст */
    text-overflow: ellipsis; /* Добавляем троеточие */
    padding: 8px; /* Отступы внутри ячеек */
    border: 1px solid #ddd; /* Границы ячеек */
}

/* Опционально: стиль для заголовков */
.table-data th {
    background-color: #f2f2f2; /* Цвет фона для заголовков */
    font-weight: bold; /* Жирный шрифт для заголовков */
}
</style>
